//
//  E+String.swift
//  WPFacebookTableView
//
//  Created by Alex on 12/12/20.
//

import Foundation
import UIKit

extension String {
    func strSize(with bound: CGSize, font: UIFont, miniHeight: Bool) -> CGSize {
        let nss = NSString(string: self)
        let options: NSStringDrawingOptions = [.usesLineFragmentOrigin,.usesFontLeading]
        let size = nss.boundingRect(with: bound, options: options, attributes: [.font: font], context: nil).size
        var height = CGFloat(ceilf(Float(size.height)))
        if miniHeight {
            height = max(height, 40)
        }
        return CGSize(width: size.width, height: height)
    }
}


extension String {

    static var random: String {
        get {
            let texts = String.full.split(separator: "\n")
            let idx = Int.random(in: 0 ..< texts.count)
            return String(texts[idx])
        }
        
    }
    
    static var full: String {
        get {
            return
                """
                如果是在阿林厄或者阿尔托，这个时间已经是炎热难挡，空气仿佛能燃烧起来，可在这座熙熙攘攘，建筑物似乎汇聚了大陆诸多国家风格的混乱狭窄城市里，凉风依旧徐徐吹拂，如同春暖花开的三月。

                这里就是“北地”西北深处的瑟谷，周围被无数参天巨木所包裹的“东流亡地”！

                因为北地沿着暴风海峡的繁华城邦被魔法议会“帕尔梅拉的小屋”掌控，并且他们的实力深入北地，扫荡了诸多兽人、矮人部落和巨魔等怪物，建立了不少城市，所以在大部分人心中，北地就是“帕尔梅拉的小屋”这个组织的领地，就是魔法议会的天然控制地带，

                可实际上，“北地”西至沙赫兰帝国西北行省，东抵无尽汪洋出海口最北端的“不冻港”明塔克，南接沙赫兰帝国北方烈焰要塞和暴风海峡，北临常年结冰不化，半年黑暗半年白昼的极地，幅员辽阔，远远超过了面积最大的帝国沙赫兰，魔法议会和帕尔梅拉的小屋仅能控制东南地带，深处则被恐怖的巨魔、兽人、雪人以及隐居的古代魔法师们占据。

                而瑟谷位置特殊，处在北地沿海核心与沙赫兰帝国东北广阔原始森林的交界处，由于北方教会和魔法议会互相对峙，并且彼此势力又难以深入此处，因此这里成为了三不管地带，诸多来自沙赫兰帝国的流亡贵族、罪犯慢慢汇聚于此，在山谷内建立了瑟谷城市和诸多庄园，被外人统称为东流亡地。

                这些桀骜不驯或残忍狠毒的家伙们一边与巨魔等怪物战斗。一边发展走私贸易，虽然初步建立了粗疏的法律，但表面掩盖之下充满了危险。“剑与魔法的法则才是北地的法则！”

                不过由于其垄断了北地和沙赫兰帝国的走私贸易，因此依然有无数渴望着金钱的商人、冒险者不顾危险前来，让这里非常繁华。当然，商人们绝大部分都招揽了不错的手下或佣兵。否则早就被杀死丢入森林内喂野兽去了。

                路西恩悠闲地漫步在瑟谷十字街头，目标是前方的古松小屋，根据魔法议会的资料。其是瑟谷比较有名的情报组织。

                穿着白色衬衣、黑色双排扣长礼服，带着高礼帽和单片眼镜的路西恩，因为年纪轻，相貌俊秀，没有足够的威慑力，所以在东流亡地的居民眼中他就是一块鲜美可口的肥肉，经过他周围的不少人都目光阴冷地上下打量着。琢磨着该怎么创造机会绑架他。

                “他衣着低调奢华，身上想必有不少财宝。啧，即使是个穷光蛋，光凭外表和气质，也能调教之后卖给沙赫兰帝国那些贵妇或贵族们当秘密情人。”两个明显有野蛮人血统的大汉擦肩而过时。互相交流着。

                “再观察一下，敢孤身一人到东流亡地来，肯定有些底气，不要光看外表下手。因为轻视老人、小孩、女人、瘦弱年轻人而死掉的家伙还少了吗？”另外一位大汉低声回答。

                他们这些死不悔改、手段狠辣的罪犯能够活到现在的，大部分都培养出了谨慎的性格，不过只要确认对方没有足够的实力，他们就会展现出人类最卑劣最狠毒最肆无忌惮的一面。

                路西恩临出发时，不仅将两千两百个提前支付的奥术点全部兑换成了魔法药剂、施法材料、黄金以及“魔法师小屋”，而且还从元素意志那里得到一瓶叫做“血液净化剂”的奇怪药剂，弥补了服用“哭泣灵魂”产生的潜在创伤，从准骑士的实力提升到了正式骑士的水准，因此即使没用精神力感应，耳朵也直接听到了两个大汉的对话，不仅微笑摇了摇头：“不愧是东流亡地……”

                可惜魔法议会在药剂提升血脉上的研究就到此为止，因为越往上走，基于自身骑士信条的意志作用就越大。如果路西恩是在阿林厄得到正规药剂的辅助，那还有希望像瓦欧里特大公那样成为二级骑士，但路西恩自己调配古代药剂激发，能成为正式骑士都是“血液净化剂”效果显著了。

                仿佛什么也没听到的路西恩从容地走在瑟谷街头，很快来到画着茶花的“古松小屋”门口。

                守在大门旁边的一位彪形大汉右手伸出，拦住准备走进去的路西恩，粗犷的声音充满嘲笑意味：“这里不是小孩子能够来的地方。”

                一边说，他一边鼓起右手古铜色的肌肉，展现自己的力量。

                路西恩没有生气地笑道：“那什么人才能够来？”

                彪形大汉冷哼一声，指了指门上刻着的格言，没有说话。

                在茶花的旁边用沙赫兰文字和通用语文字同时刻着“要么金钱，要么力量”。

                路西恩微笑点了点头：“我明白了。”

                这彪形大汉突然觉得眼前这位年轻男子是自己心里最仰慕、最畏惧的对象，似乎其就是支撑着东流亡地的几位强者，于是背弯得如同长弓一样讨好笑道：“尊敬的先生，请进，请进，刚才是我嘴巴不干净。”

                他啪啪啪抽着自己耳光的同时，在同伴睁大的眼睛中带着路西恩往房屋内走去。

                “东尼，他，他被鬼魂附身了吗？！”瑟谷八月的凉风吹过，他的同伴忍不住打了个寒颤，其前倨后恭的表现实在诡异，“难道，难道是正式魔法师？可我都没有感应到魔法波动！”

                迟疑了一阵，这位大汉赶紧转身往古松小屋内跑去，通知主持者这件事情。

                而跟随着路西恩过来的人口贩子们艰难地吞咽了口唾沫，要是刚才贸然出手，会不会也像东尼那样？

                其没魔法波动就“控制”了东尼，这绝非普通魔法师能够办到！即使东流亡地背后隐藏的古代高阶魔法师似乎也很难！

                路西恩改良后的魅惑人类（骑士版）本身就以魔法波动小著称，而且三环魔法师施展一环魔法和一环魔法施展一环魔法，在控制力、威力上又有天堂山与深渊的差别。这些连正式骑士等级都没有家伙拿什么去感应微小的魔法波动！

                …………

                古松小屋内分了很多隐秘隔间，每个隔间内都有不同人买卖情报，环境非常安雅。

                东尼带着路西恩直愣愣地往楼梯口走去。那里守着两位肌肉结实、身佩长剑的汉子。

                “东尼，这位先生是？”寒光闪闪的长剑横在了东尼面前。

                东尼躬着背，目光指了指路西恩：“这位是古松先生的重要客人。你们让开。”路西恩站在他的身后，嘴角含笑。什么话也没说。

                拿剑的汉子疑惑道：“我怎么没听古松先生说过？”

                “我先去禀报古松先生。”另外一位汉子没有大意，转身往楼上而去。

                他刚刚转身，东尼突然扑了上来。右手握拳狠狠一挥，直接击到了握剑挡路的那位汉子太阳穴上。

                拿剑汉子猝不及防，耳朵一嗡，眼前一黑，晕了过去。

                楼梯上的汉子大惊之下刚要转身一剑砍向东尼，脑袋忽然眩晕，笑容堆满马脸地道：“尊敬的先生。他竟然拿剑挡住您，实在是太没有礼貌了！我们已经狠狠地教训了他，请您原谅，我马上引您去找古松先生。”

                路西恩推了推单片眼镜，没有说话地跟了上去。心中暗道：“以我目前的精神力，魅惑人类看来只能同时控制三个人……”

                东尼击倒拿剑汉子的一幕被追进来的同伴看见，于是大声叫道：“古松先生，有人袭击！”

                楼上的古松叼着一根粗大的布里亚纳雪茄走出房间，穿着黑色长风衣的他气势威严地环视下面，背后跟着一位穿着黑色全身盔甲的护卫。

                “古松先生，我是来打听情报的。”一直安静的路西恩微笑抬头。

                古松脸色严肃阴沉地道：“我不管你有什么目的，既然敢强闯这里，就必须付出代价！拿下他！”虽然是靠药剂激发的准骑士，但自己有一件不错的魔法物品，还重金招揽了两位正式黑暗骑士，因此古松决定先维持在属下面前的威严和脸面。

                这么年轻、这么瘦弱的家伙能有多强？

                而且他怀疑路西恩是自己竞争对手派来捣乱的，要是让他靠近，很可能被其刺杀！靠着几代人生活在东流亡地，有不少人脉资源才成立情报组织的古松实力上是短板，非常害怕其他情报组织的暗杀。

                角落里，一道影子猛地冒出，扑向路西恩，而古松背后那位穿着黑色全身盔甲的骑士身体鼓起变大，提着燃烧赤红火焰的巨锤冲锋下来。

                四面八方还有不少打手包围。

                古松则维持着自己老大气派地平静抽着雪茄。突然，一阵魔法波动后，他看到那位二级的影子骑士扑到一半就摔落在地板上，然后像是遇到了魔鬼般惊慌失措地转身就逃，转眼间就消失在了阴影里。蛮牛骑士更加不堪，冲锋到中途是强行转身，接着仿佛被天骑士追杀一样一路撞破墙壁而逃，咚咚咚之后，只留下一个个栩栩如生的人形窟窿。

                那些肌肉发达的打手全部瘫软在地，身下有着可疑的水迹，同时散发出恶臭。

                啪，古松嘴里的雪茄落在了地上，可他却毫无所觉，惶恐地看着面前的路西恩，一步一步下意识往后退去。

                路西恩施展了二环魔法“群体惊恐术”后，双手插在黑色双排扣长礼服口袋里慢慢向着楼上走去，一边走一边微笑道：“古松先生，现在可以好好谈话了吧？”

                “可，可以。”古松牙齿打颤地回答，脚下踉跄，差点倒在地上。

                既然到了东流亡地，路西恩就遵守他们“要么黄金，要么力量”的规则展现自己的实力，这是最好的办事方法，并能提前规避麻烦。

                而路西恩中阶的魔法实力，在阿林厄似乎不太起眼，随随便便就能碰到一堆四环、五环的魔法师，甚至高阶魔法师也能经验遇见，可在阿林厄之外，一位中阶的强者就足以统治一个城了，即使是东流亡地这种地方，中阶的大骑士、魔法师和主教级守夜人也是很少。

                路西恩黑色皮鞋踏在二楼地板上，发出清脆的声音，不急不徐地道：“古松先生，我需要一位向导，一位可以带着我穿过沙赫兰帝国的向导。”

                靠飞行术趁夜晚从高空越过边界不难，可想直接飞过宽阔的沙赫兰帝国，由于花费时间很长，速度又不算快，一不小心就会被北方教会发现并追杀，因此路西恩需要一个假的身份以及一位充当管家的向导。
                """
        }
    }

}
